docs/leets/0719-Find-K-th-Smallest-Pair-Distance.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-14 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0719. Find K-th Smallest Pair Distance</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-08-14
</div>
<div id="content" class="content">
<header>
<h1 class="title">0719. Find K-th Smallest Pair Distance</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgff30a81">Problem</a></li>
<li><a href="#org62f8be1">Solution Description</a></li>
<li><a href="#org4c77b58">Example</a></li>
<li><a href="#org888632c">References</a></li>
<li><a href="#org8919ade">Solution</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgff30a81" class="outline-2">
<h2 id="orgff30a81">Problem</h2>
<div class="outline-text-2" id="text-orgff30a81">
<p>
Given an integer array <code>nums</code> and an integer <code>k</code>, return the k-th smallest distance among all the pairs in the array. The distance between a pair (i, j) is defined as <code>|nums[i] - nums[j]|</code>. The problem in simpler terms is to find the k-th smallest absolute difference in any two elements in the array <code>nums</code>.
</p>
</div>
</div>

<div id="outline-container-org62f8be1" class="outline-2">
<h2 id="org62f8be1">Solution Description</h2>
<div class="outline-text-2" id="text-org62f8be1">
<p>
To implement the solution, we need to:
</p>
<ol class="org-ol">
<li><b><b>Sort the array</b></b>: Sorting will help us to easily calculate distances and use binary search effectively.</li>
<li><b><b>Use Binary Search on distance</b></b>: The smallest distance is 0 (if there are duplicate elements), and the largest distance is <code>nums[nums.length-1] - nums[0]</code>. Use binary search to find the k-th smallest distance.</li>
<li><b><b>Count pairs with a distance ≤ mid</b></b>: For each midpoint of the search, count how many pairs have a distance less than or equal to the midpoint. Adjust the binary search range based on whether this count is greater than, less than, or equal to k.</li>
</ol>

<p>
This approach uses the binary search method, which ensures an optimal time complexity of O(n log n + n log(max-min)) where n is the length of the input array.
</p>
</div>
</div>

<div id="outline-container-org4c77b58" class="outline-2">
<h2 id="org4c77b58">Example</h2>
<div class="outline-text-2" id="text-org4c77b58">
<p>
Consider an array [1, 3, 1] and k = 1. The sorted array is [1, 1, 3]. Possible pairs (distances) are:
</p>
<ul class="org-ul">
<li>(1,1) -&gt; distance = 0</li>
<li>(1,3) -&gt; distance = 2</li>
<li>(1,3) -&gt; distance = 2</li>
</ul>
<p>
Therefore, the 1st smallest distance is 0.
</p>
</div>
</div>

<div id="outline-container-org888632c" class="outline-2">
<h2 id="org888632c">References</h2>
<div class="outline-text-2" id="text-org888632c">
<p>
For this problem, we are using binary search methods over possible distances, combined with pair counting.
</p>
</div>
</div>

<div id="outline-container-org8919ade" class="outline-2">
<h2 id="org8919ade">Solution</h2>
<div class="outline-text-2" id="text-org8919ade">
<div class="org-src-container">
<pre class="src src-js">// Helper functions to add logs and tables
const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
const table = typeof NestedInteger!== 'undefined' ? () =&gt; {} : console.table;

/**
 * Main function to find the k-th smallest pair distance
 * @param {number[]} nums - Array of integers
 * @param {number} k - The k-th position
 * @returns {number} The k-th smallest pair distance
 */
function findKthSmallestPairDistance(nums, k) {
    // return dummy result for now

    return -1;
}

/**
 * Test cases to validate the solution
 */
const testCases = [
    { nums: [1, 3, 1], k: 1, expected: 0 },
    { nums: [1, 1, 1], k: 2, expected: 0 },
    { nums: [1, 6, 1], k: 3, expected: 5 },
    { nums: [1, 6, 1, 2], k: 4, expected: 5 },
    { nums: [1, 3, 5], k: 3, expected: 4 },
];

testCases.forEach((test, index) =&gt; {
    const result = findKthSmallestPairDistance(test.nums, test.k);
    log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
